EDA

Data Mining

In [2]:
import pandas as pd
df = pd.read_csv('emp2.csv')

In [3]:
df.head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus,Senior Management,Team
0,Douglas,Male,08-06-1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,06:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,03-04-2005,01:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,04:47 PM,101004,1.389,True,Client Services

In [4]:
df.sample(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus,Senior Management,Team
666,Harold,NaN,02-04-2004,11:02 AM,79459,7.776,True,Business Development
700,Frank,Male,03-02-2009,09:15 PM,78891,7.927,True,Distribution
228,Bobby,Male,9/23/1994,01:29 AM,51685,17.445,True,Engineering
995,Henry,NaN,11/23/2014,06:09 AM,132483,16.655,False,Distribution
839,Joyce,Female,7/25/2001,06:04 AM,51065,16.807,False,Human Resources

In [5]:
df.isnull()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus,Senior Management,Team
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,True
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,True,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [6]:
df.isnull().all()

First Name           False
Gender               False
Start Date           False
Last Login Time      False
Salary               False
Bonus                False
Senior Management    False
Team                 False
dtype: bool

In [7]:
df.isnull().any()

First Name            True
Gender                True
Start Date           False
Last Login Time      False
Salary               False
Bonus                False
Senior Management     True
Team                  True
dtype: bool

In [8]:
df['Salary'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Salary, Length: 1000, dtype: bool

In [12]:
df['Salary'].isnull().any()

False

In [13]:
df['Bonus'].isnull().all()

False

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus              1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [15]:
df.describe()

              Salary        Bonus
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

Making new data frame df2

In [2]:
import pandas as pd2
df2 = pd2.read_csv('emp2.csv')

In [3]:
df2.sample(20)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus,Senior Management,Team
167,Christopher,Male,12/24/2011,12:22 PM,142178,17.984,True,Sales
397,Clarence,Male,1/13/2005,09:00 AM,116693,13.835,True,Distribution
860,Phillip,Male,10-07-1984,11:05 AM,36837,14.660,False,Marketing
873,Jason,Male,05-01-1998,06:05 PM,75607,4.299,True,Sales
133,Lois,Female,12/25/1987,04:16 PM,106317,2.235,True,Client Services
624,Jeremy,Male,11/26/1997,08:22 AM,133033,12.200,False,Sales
173,Lillian,Female,12/21/2008,06:51 PM,85446,3.959,True,Engineering
813,Evelyn,Female,02-10-2002,04:44 AM,123621,19.767,True,Marketing
136,Henry,Male,4/24/1995,04:18 AM,43542,19.687,False,Legal
987,Gloria,Female,12-08-2014,05:08 AM,136709,10.331,True,Finance
620,Ralph,Male,03-07-2012,02:25 AM,81215,8.400,False,Finance
917,Shawn,Male,3/13/2008,05:36 PM,51667,6.339,False,Product
850,Charles,Male,09-03-1997,10:04 AM,148291,6.002,False,NaN
652,Willie,Male,12-05-2009,05:39 AM,141932,1.017,True,Engineering
312,Gerald,Male,4/16/2001,10:09 PM,121604,1.923,True,Sales
669,Joseph,NaN,3/28/1982,01:05 PM,86564,11.879,True,NaN
435,Billy,Male,12-01-2006,03:32 PM,144709,10.069,True,Distribution
93,Virginia,NaN,05-07-1994,05:58 PM,111858,1.601,True,Legal
984,Maria,Female,10/15/2011,04:53 PM,43455,13.040,False,Engineering
690,Bruce,Male,1/28/2007,11:10 PM,134988,13.926,True,Sales

In [4]:
df2.isnull().any()

First Name            True
Gender                True
Start Date           False
Last Login Time      False
Salary               False
Bonus                False
Senior Management     True
Team                  True
dtype: bool

In [5]:
columns_to_check = ['First Name','Gender','Senior Management','Team']

In [8]:
all_missing = df2[columns_to_check].isnull().any()

In [10]:
print(all_missing)

First Name           True
Gender               True
Senior Management    True
Team                 True
dtype: bool

In [11]:
all_missing = df2[columns_to_check].isnull().all()

In [12]:
print(all_missing)

First Name           False
Gender               False
Senior Management    False
Team                 False
dtype: bool

In [13]:
any_missing = df2[columns_to_check].isnull().any()

In [14]:
print(any_missing)

First Name           True
Gender               True
Senior Management    True
Team                 True
dtype: bool

In [15]:
any_missing_combination = df2[columns_to_check].isnull().any().all()

In [16]:
print(any_missing_combination)

True

In [17]:
any_missing_combination2 = df2[columns_to_check].isnull().any().any()

In [18]:
print(any_missing_combination2)

True

In [21]:
mask = df2[columns_to_check].isnull().all(axis=1)

In [22]:
print(mask)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [23]:
mask2 = df2[columns_to_check].isnull().any(axis=1)

In [24]:
print(mask2)

0      False
1       True
2      False
3      False
4      False
       ...
995     True
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [25]:
rows_with_missing_values = df2[df.isnull().any(axis=1)]

NameError: name 'df' is not defined

In [26]:
rows_with_missing_values = df2[df2.isnull().any(axis=1)]

In [27]:
print(rows_with_missing_values)

    First Name  Gender  Start Date Last Login Time  Salary   Bonus  \
1       Thomas    Male   3/31/1996        06:53 AM   61933   4.170
7          NaN  Female   7/20/2015        10:43 AM   45906  11.598
10      Louise  Female  08-12-1980        09:01 AM   63241  15.132
20        Lois     NaN   4/22/1995        07:18 PM   64714   4.934
22      Joshua     NaN  03-08-2012        01:58 AM   90816  18.816
..         ...     ...         ...             ...     ...     ...
961    Antonio     NaN   6/18/1989        09:37 PM  103050   3.050
972     Victor     NaN   7/28/2006        02:49 PM   76381  11.159
985    Stephen     NaN  07-10-1983        08:10 PM   85668   1.909
989     Justin     NaN  02-10-1991        04:58 PM   38344   3.794
995      Henry     NaN  11/23/2014        06:09 AM  132483  16.655

    Senior Management             Team
1                True              NaN
7                 NaN          Finance
10               True              NaN
20               True            Legal
22               True  Client Services
..                ...              ...
961             False            Legal
972              True            Sales
985             False            Legal
989             False            Legal
995             False     Distribution

[236 rows x 8 columns]

In [29]:
rows_with_missing_values = df2[df2[columns_to_check].isnull().any(axis=1)]

In [30]:
print(rows_with_missing_values)

    First Name  Gender  Start Date Last Login Time  Salary   Bonus  \
1       Thomas    Male   3/31/1996        06:53 AM   61933   4.170
7          NaN  Female   7/20/2015        10:43 AM   45906  11.598
10      Louise  Female  08-12-1980        09:01 AM   63241  15.132
20        Lois     NaN   4/22/1995        07:18 PM   64714   4.934
22      Joshua     NaN  03-08-2012        01:58 AM   90816  18.816
..         ...     ...         ...             ...     ...     ...
961    Antonio     NaN   6/18/1989        09:37 PM  103050   3.050
972     Victor     NaN   7/28/2006        02:49 PM   76381  11.159
985    Stephen     NaN  07-10-1983        08:10 PM   85668   1.909
989     Justin     NaN  02-10-1991        04:58 PM   38344   3.794
995      Henry     NaN  11/23/2014        06:09 AM  132483  16.655

    Senior Management             Team
1                True              NaN
7                 NaN          Finance
10               True              NaN
20               True            Legal
22               True  Client Services
..                ...              ...
961             False            Legal
972              True            Sales
985             False            Legal
989             False            Legal
995             False     Distribution

[236 rows x 8 columns]

In [31]:
columns_with_missing_values = df2.columns[df2.isnull().any()].tolist()

In [33]:
print(df2[columns_with_missing_values])

    First Name  Gender Senior Management                  Team
0      Douglas    Male              True             Marketing
1       Thomas    Male              True                   NaN
2        Maria  Female             False               Finance
3        Jerry    Male              True               Finance
4        Larry    Male              True       Client Services
..         ...     ...               ...                   ...
995      Henry     NaN             False          Distribution
996    Phillip    Male             False               Finance
997    Russell    Male             False               Product
998      Larry    Male             False  Business Development
999     Albert    Male              True                 Sales

[1000 rows x 4 columns]

In [34]:
rows_with_empty_values = df2.loc[df2[columns_with_missing_values].isnull().any(axis=1)]

In [35]:
print(rows_with_empty_values)

    First Name  Gender  Start Date Last Login Time  Salary   Bonus  \
1       Thomas    Male   3/31/1996        06:53 AM   61933   4.170
7          NaN  Female   7/20/2015        10:43 AM   45906  11.598
10      Louise  Female  08-12-1980        09:01 AM   63241  15.132
20        Lois     NaN   4/22/1995        07:18 PM   64714   4.934
22      Joshua     NaN  03-08-2012        01:58 AM   90816  18.816
..         ...     ...         ...             ...     ...     ...
961    Antonio     NaN   6/18/1989        09:37 PM  103050   3.050
972     Victor     NaN   7/28/2006        02:49 PM   76381  11.159
985    Stephen     NaN  07-10-1983        08:10 PM   85668   1.909
989     Justin     NaN  02-10-1991        04:58 PM   38344   3.794
995      Henry     NaN  11/23/2014        06:09 AM  132483  16.655

    Senior Management             Team
1                True              NaN
7                 NaN          Finance
10               True              NaN
20               True            Legal
22               True  Client Services
..                ...              ...
961             False            Legal
972              True            Sales
985             False            Legal
989             False            Legal
995             False     Distribution

[236 rows x 8 columns]

In [36]:
rows_with_missing_values = df2[df2.isnull().any(axis=1)]

In [37]:
columns_with_missing_values = df2.columns[df2.isnull().any()].tolist()

In [39]:
columns_with_missing_values = df2.columns[rows_with_missing_values.isnull().any()].tolist()

In [40]:
print(columns_with_missing_values)

['First Name', 'Gender', 'Senior Management', 'Team']